---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.RebarShapeConstraintFixedSegmentDir
source: html/60a42d36-f18f-7de7-9776-25b56a9aa759.htm
---
# RebarShapeConstraintFixedSegmentDir Members

Create a fixed segment direction constraint.